const {month}= require("../month.js");

describe("Проверка месяца", () => {
    it("1 = январь",
        expect(1===1).toBe("январь"));
    it("2 = февраль", () =>
        expect(2===2).toBe("февраль"));
    it("3 = март", () =>
        expect(3===3).toBe("март"));
    it("4 = апрель", () =>
        expect(4===4).toBe("апрель"));
    it("5 = май", () =>
        expect(5===5).toBe("май"));
    it("6 = июнь", () =>
        expect(6===6).toBe("июнь"));
    it("7 = июль", () =>
        expect(7===7).toBe("июль"));
    it("8 = август", () =>
        expect(8===8).toBe("август"));
    it("9 = сентябрь", () =>
        expect(9===9).toBe("сентябрь"));
    it("10 = октябрь", () =>
        expect(10===10).toBe("октябрь"));
    it("11 = ноябрь", () =>
        expect(11===11).toBe("ноябрь"));
    it("12 = декабрь", () =>
        expect(12===12).toBe("декабрь"));
    it("0 = error", () =>
        expect(-1<0).toBe("Число не должно быть меньше единицы"));

});